import {useState} from 'react'
import "../content/css/contract.css"
import {Link} from "react-router-dom";
const ContractPage = () => {

    const [isChecked , setIsChecked] = useState(false);

    return (
        <div className="container">
            <div>
                <br />
                <p> قرداد خرید مفید کارت </p>

                <div className={"contract-text"}>
                <h5>قرارداد استفاده از خدمات بانکداری مجازی بانک پاسارگاد</h5>
<p>این قرارداد بر اساس قوانین و مقررات بین شرکت کارگزاری مفید (سهامی خاص) به شماره ثبت 109737 و شناسه ملی 10101534680 با نمایندگی آقای هادی مهری (مدیرعامل)، حسن آذرخش (عضو هیئت مدیره) به نشانی تهران، تهران، خیابان آفریقا، بالاتر از چهارراه جهان کودک، نبش دیدار شمالی، کارگزاری مفید، کد پستی 1518943311، شماره تلفن 8700 ، شماره نمابر 81900 به نشانی سایت اینترنتی <a href="about:blank">www.emofid.com</a> که از این پس &laquo;کارگزار&raquo; نامیده می&zwnj;شود از یک طرف، و آقا/ خانم .... با کدملی .... &laquo;مشتری&raquo; با مشخصات مندرج در حساب کاربری مشتری در سامانه کارگزار که در هر زمان توسط مشتری قابل تغییر و اصلاح است (از این پس "فرم مشخصات مشتری") ، به شرح مواد ذیل منعقد گردید.</p>
<h6>مادۀ 1 :موضوع قرارداد</h6>
<p>موضوع این قرارداد عبارت است از ارائه خدمات بانکداری مجازی بانک پاسارگاد مبتنی بر حساب کاربری مشتری نزد کارگزار مطابق مفاد این قرارداد.</p>
<h6>مادۀ 2: چارچوب خدمات</h6>
<ol  style={{direction:"rtl"}}>
<li>کارگزاری مفید درنظر دارد برای تکمیل زنجیره خدمات و ایجاد ارزش برای مشتریان خود، خدمت جدیدی با اتصال حساب کاربری مشتری نزد کارگزاری مفید و حساب دیجیتال نزد بانک پاسارگاد (ازاین پس "<strong>حساب دیجیتال</strong>") ایجاد کند.</li>
<li>در این طرح مشتری قادر خواهد بود پس از درخواست وجه از طریق حساب کاربری، پول را به صورت آنی از حساب کارگزاری به حساب بانکی مجازی خود منتقل کند.</li>
<li>ارائه خدمات منوط به ثبت نام و افتتاح حساب دیجیتال برای مشتری حقیقی مفید با قابلیت صدور کارت نقدی مبتنی بر حساب دیجیتال نزد بانک خواهد بود.</li>
<li>استفاده از این خدمات منوط به رعایت مفاد این قرارداد است و تازمانی که قوانین و مقررات، منع یا محدودیتی در این راستا ایجاد نکرده باشند ادامه خواهد داشت.</li>
</ol>
<h6>ماده 2: مدت قرارداد</h6>
<p>این قرارداد از تاریخ انعقاد (امضا) به مدت نامحدود اعتبار دارد &nbsp;مگر مطابق این قرارداد منحل شود.</p>
<h6>ماده 3: حقوق و تعهدات مشتری</h6>
<ol  style={{direction:"rtl"}}>
<li>مشتری ملزم به ثبت نام و افتتاح حساب دیجیتال بر اساس رویه های کارگزار در حساب کاربری خود می باشد.</li>
<li>مشتری با تایید و امضای این قرارداد درخواست افتتاح حساب دیجیتال را به کارگزار ارائه نموده است و کارگزار مجاز به ارائه کلیه اطلاعات مورد نیاز بانک میباشد. همچنین مشتری باید اطلاعات تکمیلی مورد نیاز بانک را در اختیار کارگزار قرار دهد.</li>
<li>مشتری مسئول کنترل حساب دیجیتال خود می باشد. مشتری مکلف است پس از ارائه هر دستور دریافت یا پرداخت وجه با مراجعه به حساب کاربری از وضعیت اجرای دستور ارائه شده مطلع شود. در صورت وجود هرگونه مغایرت در حساب دیجیتال، مراتب توسط مشتری به اطلاع کارگزار می رسد.</li>
<li>مغایرت در بند قبل شامل و نه محدود به هرگونه استفاده غیر مجاز از حساب دیجیتال، نام کاربری، شماره حساب، اطلاعات نادرست در موجودی حساب مشتری و تمام مواردی که بر حقوق مشتری تاثیرگذار است می باشد. در هر حال عدم طرح موضوع و یا اعتراض از سوی مشتری یا عدم اعلام مغایرت ظرف مدت یک هفته از تاریخ انجام تراکنش در حساب دیجیتال، به منزله تأیید و تنفیذ اقدامات انجام شده بر روی حساب دیجیتال است.</li>
<li>مشتری با امضا ذیل این قرارداد صحت و اصالت کلیه اطلاعات، اسناد و مدارکی را که در اختیار کارگزاری قرار می&zwnj;دهد، تأیید می&zwnj;نماید. در هر حال کلیه تبعات و مسئولیت&zwnj;های کیفری و حقوقی ناشی از ارائه اسناد و مدارک غیرواقعی یا ارائه اطلاعات به نحو غیرصحیح، یا استفاده از حساب دیجیتال بر خلاف قوانین و مقررات تماماً بر عهده مشتری خواهد بود.</li>
</ol>
<h6>مادۀ 3: حقوق و تعهدات کارگزار</h6>
<ol  style={{direction:"rtl"}}>
<li>پس از افتتاح حساب و تایید آن توسط بانک، کارگزار کارت مبتنی بر حساب دیجیتال را در اختیار مشتری قرار می دهد.</li>
<li>كارگزار می&zwnj;تواند در هر زمان به تشخیص خود ارائه خدمات موضوع این قرارداد به مشتری را معلق یا قطع نماید. در این صورت، كارگزار مسئولیتی در قبال خسارات وارده به مشتری نخواهد داشت.</li>
<li>پشتیبانی از مشتری در خصوص حساب دیجیتال برعهده کارگزار است و مشتری ارتباط مستقیمی در این خصوص با انک پاسارگاد نخواهد داشت.</li>
<li>کارگزار می تواند هزینه ارائه خدمات توسط بانک را از حساب مشتری کسر و برداشت نماید.</li>
<li>با عنایت به اینکه دسترسی به حساب دیجیتال این امکان را برای مشتری فراهم می نماید که زودتر از مواعد تعیین شده در قوانین و مقررات بازار سرمایه، وجه حاصل از معاملات خود را دریافت نماید، ضمن عقد خارج لازم، کارگزار را ماذوون در برداشت و تسویه وجوه دریافت شده توسط مشتری (از حساب دیجیتال) پیش از موعد می نماید.</li>
<li>چنانچه به دلیل اشتباه فنی یا خطای سیستم در محاسبات، مشتری وجهی بیشتر از آنچه محق است و به وی تعلق می&shy;گیرد، برداشت نماید ملزم به جبران هزینه ها و خسارات کارگزار می باشد.</li>
<li>کارگزار ضمن عقد خارج لازم، بانک پاسارگاد را ماذون در انتقال وجوه ناشی از معاملات خود به حساب کارگزاری مفید می نماید و در این خصوص هیچگونه ادعایی ندارد و هرگونه حق مربوط به طرح دعوا یا ادعا یا مطالبه خسارت را نزد هر یک از مراجع اداری قضایی و شبه قضایی از خود سلب و ساقط نمود.</li>
</ol>
<h6>ماده 5 :نحوه برقراری ارتباط بین مشتری و کارگزار</h6>
<p>در مواردی که کارگزار بر اساس این قرارداد ملزم به اطلاع&zwnj;رسانی به مشتری است، کلیه اطلاع&zwnj;رسانی&zwnj;ها و مکاتبات به یکی از طرق زیر به تشخیص کارگزار انجام می&zwnj;گردد:</p>
<p>الف) پیامک: ارسال پیامک به شماره همراه &nbsp;ثبت شده مشتری نزد کارگزار</p>
<p>ب) ایمیل: ارسال به ایمیل ثبت شده نزد کارگزار</p>
<p>ج) سایت: اعلام در سایت اینترنتی کارگزار</p>
<p>د) سامانه: هرگونه سامانه الکترونیکی که توسط کارگزار طراحی می&zwnj;شود و دسترسی به آن به طرق مقتضی در اختیار مشتری قرار می&zwnj;گیرد.</p>
<h6>ماده 6: فورس ماژور (قوه قاهره)</h6>
<p>هر گاه اجرای تمام یا بخشی از قرارداد به واسطه یک امر خارجیِ غیرقابل دفع و غیرقابل پیش&shy;بینی از جمله جنگ، سیل، زلزله و اعتصاب، غیرممکن شود یا به تأخیر افتد، مسئولیتی متوجه کارگزار نیست و کارگزار مسئول جبران خسارات ناشی از عدم اجرا یا تأخیر در اجرای قرارداد نیست. در این صورت کارگزار مکلف است از طریق سایت اینترنتی خود در اسرع وقت مراتب را به مشتری اطلاع دهد.</p>
<h6>ماده 7: انحلال قرارداد</h6>
<p>کارگزار می&zwnj;تواند با اعلام به مشتری به طرق مندرج در ماده 5 قرارداد را فسخ نماید. بدین منظور اخطار کارگزار سه روز قبل به مشتری اعلام می&zwnj;شود.</p>
<p><strong>تبصره 1: </strong>فسخ قرارداد با دریافت خسارات قابل جمع است و کارگزار می&zwnj;تواند پس از فسخ نیز جبران خسارات و هزینه های ناشی از نقض قرارداد را از مشتری مطالبه نماید.</p>
<p><strong>تبصره 2: </strong>در صورت فسخ قرارداد، مشتری مکلف است فوراً نسبت به تسویه كلیه دیون و تعهدات مربوط به حاب دیجیتال اقدام نماید.</p>
<h6>ماده 8: حل و فصل اختلافات</h6>
<p>در صورت بروز اختلاف در تفسیر یا اجرای مفاد تمام یا بخشی از این قرارداد، مشتری ابتدا به کارگزار مراجعه می&zwnj;نماید و کارگزار ظرف ده روز کاری مبادرت به بررسی موضوع و ارائه راه حل به مشتری می&zwnj;نماید. در صورت عدم حصول توافق بین مشتری و کارگزار، طرف ذینفع می&zwnj;تواند خواسته خود را از مراجع ذیصلاح پیگیری نماید.</p>
<h6>ماده 9: اقامتگاه قانونی و اطلاعات تماس طرفین</h6>
<ol style={{direction:"rtl"}}>
<li>نشانی و اطلاعات تماس مشتری همان است که در فرم مشخصات مشتری درج شده&zwnj;است.تا زمانی که نشانی و اطلاعات تماس جدید اعلام نشده، مکاتبات به نشانی قبلی ارسال و برقراری ارتباط از طریق اطلاعات تماس قبلی انجام می&zwnj;شود.</li>
<li>اعلام نشانی و اطلاعات تماس جدید کارگزار بر روی سایت اینترنتی کارگزار، به منزله اعلام آن به مشتری و اطلاع وی خواهد بود.</li>
</ol>
<p>&nbsp;</p>
<p>این قرارداد در 9 ماده، در دو نسخه که هر دو اعتبار واحد دارند، تنظیم شد و در دفتر کارگزاری مفید به نشانی مندرج در مقدمه قرارداد به امضای طرفین رسید. هریک از طرفین با امضای نسخه طرف مقابل، به دریافت نسخه خود اقرار می&zwnj;نماید. در صورت انعقاد قرارداد به صورت الکترونیکی، تایید قرارداد به منزله قبول و امضای آن توسط مشتری و دریافت یک نسخه از آن می&zwnj;باشد.</p>
                </div>
            </div>

            <div>
                <span> قرار داد خدمات مفید کارت را خوانده ام و می پذیرم </span>
                <input type={"checkbox"} onChange={e => setIsChecked(e.target.checked)}/>
            </div>

            <br />
            {isChecked && <Link to={"/kyc"} disabled={!isChecked} className={"btn btn-primary btn-lg"}> تایید  </Link>}
            {!isChecked && <button disabled={!isChecked} className={"btn btn-primary btn-lg"}> تایید  </button>}

        </div>
    )
}

export default ContractPage;

